app/controllers/assets_controller.rb

SELECT * FROM "projects" WHERE ("projects"."id" = 3) ORDER BY projects.position ASC, projects.name ASC
INSERT INTO "assets" ("name", "position", "image_file_name", "created_at", "image_file_size", "guid", "project_id", "updated_at", "image_content_type", "alt_text", "description", "image_updated_at") VALUES('Photo', NULL, NULL, '2009-11-16 15:10:55', NULL, 'photo', 1, '2009-11-16 15:10:55', NULL, 'this is some alt text', 'Ok', NULL)
---
  def create
    @project = Project.find(params[:project_id])
    @asset = Asset.new(params[:asset])
    if @asset.save

SELECT * FROM "projects" WHERE ("projects"."id" = 1) ORDER BY projects.position ASC, projects.name ASC
SELECT * FROM "assets" WHERE ("assets"."id" = 1 AND ("assets".project_id = 1)) ORDER BY assets.position ASC, assets.name ASC
UPDATE "assets" SET "updated_at" = '2009-11-16 16:21:42', "guid" = 'photo', "image_file_size" = 314710, "image_file_name" = 'selling.jpg', "image_content_type" = 'image/jpeg', "image_updated_at" = '2009-11-16 16:21:40' WHERE "id" = 1
---
  def update
    @project = Project.find(params[:project_id])
    @asset = Asset.find(params[:id])
    if @asset.update_attributes(params[:asset])

SELECT * FROM "assets" WHERE ("assets"."id" = 1) ORDER BY assets.position ASC, assets.name ASC
UPDATE "assets" SET "updated_at" = '2009-12-21 22:57:24', "position" = 0 WHERE "id" = 1
---
  def sort
    if params[:asset]
      params[:asset].each_with_index do |id,index|
        Asset.find(id).update_attribute(:position,index)