app/controllers/projects_controller.rb

SELECT * FROM "projects" WHERE ("projects"."id" = 3) ORDER BY projects.position ASC, projects.name ASC
UPDATE "projects" SET "updated_at" = '2009-12-21 23:03:23', "position" = 0 WHERE "id" = 3
---
  def sort
    if params[:project]
      params[:project].each_with_index do |id,index|
        Project.find(id).update_attribute(:position,index)