app/controllers/site_controller.rb

  def work
    @main_heading='<span>I</span> <span>build</span> <span>web</span> <span>sites</span><span class="punctuation">.</span>'
    @featured, @projects = Project.first_with_remainder
---
SELECT * FROM "projects" ORDER BY projects.position ASC, projects.name ASC

  def spotlight
    @project = Project.find_by_guid(params[:guid])
---
SELECT * FROM "projects" WHERE ("projects"."guid" = 'rattlebox-2000') ORDER BY projects.position ASC, projects.name ASC LIMIT 1